SoCXin/HC32F4A0/src/hc32f4a0sihb_template/common/hc32f4a0sihb.h
/*  Bit definition for DMC_TMCR_T_ESR register  */
#define DMC_TMCR_T_ESR_T_ESR                           (0x000000FFUL)

/*  Bit definition for DMC_CSCR register  */
#define DMC_CSCR_ADDMSK_POS                            (0U)
#define DMC_CSCR_ADDMSK                                (0x000000FFUL)
#define DMC_CSCR_ADDMAT_POS                            (8U)
#define DMC_CSCR_ADDMAT                                (0x0000FF00UL)
#define DMC_CSCR_BRC_POS                               (16U)
#define DMC_CSCR_BRC                                   (0x00010000UL)

/*  Bit definition for DMC_BACR register  */
#define DMC_BACR_DMCMW_POS                             (0U)
#define DMC_BACR_DMCMW                                 (0x00000003UL)
#define DMC_BACR_DMCMW_0                               (0x00000001UL)
#define DMC_BACR_DMCMW_1                               (0x00000002UL)
#define DMC_BACR_CKSEL_POS                             (14U)
#define DMC_BACR_CKSEL                                 (0x0000C000UL)
#define DMC_BACR_CKSEL_0                               (0x00004000UL)
#define DMC_BACR_CKSEL_1                               (0x00008000UL)

/*******************************************************************************
                Bit definition for Peripheral DVP
*******************************************************************************/
/*  Bit definition for DVP_CTR register  */
#define DVP_CTR_CAPEN_POS                              (0U)
#define DVP_CTR_CAPEN                                  (0x00000001UL)
#define DVP_CTR_CAPMD_POS                              (1U)
#define DVP_CTR_CAPMD                                  (0x00000002UL)
#define DVP_CTR_CROPEN_POS                             (2U)
#define DVP_CTR_CROPEN                                 (0x00000004UL)
#define DVP_CTR_JPEGEN_POS                             (3U)
#define DVP_CTR_JPEGEN                                 (0x00000008UL)
#define DVP_CTR_SWSYNC_POS                             (4U)
#define DVP_CTR_SWSYNC                                 (0x00000010UL)
#define DVP_CTR_PIXCKSEL_POS                           (5U)
#define DVP_CTR_PIXCKSEL                               (0x00000020UL)
#define DVP_CTR_HSYNCSEL_POS                           (6U)
#define DVP_CTR_HSYNCSEL                               (0x00000040UL)
#define DVP_CTR_VSYNCSEL_POS                           (7U)
#define DVP_CTR_VSYNCSEL                               (0x00000080UL)
#define DVP_CTR_CAPFRC_POS                             (8U)
#define DVP_CTR_CAPFRC                                 (0x00000300UL)
#define DVP_CTR_CAPFRC_0                               (0x00000100UL)
#define DVP_CTR_CAPFRC_1                               (0x00000200UL)
#define DVP_CTR_BITSEL_POS                             (10U)
#define DVP_CTR_BITSEL                                 (0x00000C00UL)
#define DVP_CTR_BITSEL_0                               (0x00000400UL)
#define DVP_CTR_BITSEL_1                               (0x00000800UL)
#define DVP_CTR_DVPEN_POS                              (14U)
#define DVP_CTR_DVPEN                                  (0x00004000UL)

/*  Bit definition for DVP_DTR register  */
#define DVP_DTR                                        (0xFFFFFFFFUL)

/*  Bit definition for DVP_STR register  */
#define DVP_STR_FSF_POS                                (0U)
#define DVP_STR_FSF                                    (0x00000001UL)
#define DVP_STR_LSF_POS                                (1U)
#define DVP_STR_LSF                                    (0x00000002UL)
#define DVP_STR_LEF_POS                                (2U)
#define DVP_STR_LEF                                    (0x00000004UL)
#define DVP_STR_FEF_POS                                (3U)
#define DVP_STR_FEF                                    (0x00000008UL)
#define DVP_STR_SQUERF_POS                             (4U)
#define DVP_STR_SQUERF                                 (0x00000010UL)
#define DVP_STR_FIFOERF_POS                            (5U)
#define DVP_STR_FIFOERF                                (0x00000020UL)

/*  Bit definition for DVP_IER register  */
#define DVP_IER_FSIEN_POS                              (0U)
#define DVP_IER_FSIEN                                  (0x00000001UL)
#define DVP_IER_LSIEN_POS                              (1U)
#define DVP_IER_LSIEN                                  (0x00000002UL)
#define DVP_IER_LEIEN_POS                              (2U)
#define DVP_IER_LEIEN                                  (0x00000004UL)
#define DVP_IER_FEIEN_POS                              (3U)
#define DVP_IER_FEIEN                                  (0x00000008UL)
#define DVP_IER_SQUERIEN_POS                           (4U)
#define DVP_IER_SQUERIEN                               (0x00000010UL)
#define DVP_IER_FIFOERIEN_POS                          (5U)
#define DVP_IER_FIFOERIEN                              (0x00000020UL)

/*  Bit definition for DVP_DMR register  */
#define DVP_DMR                                        (0xFFFFFFFFUL)

/*  Bit definition for DVP_SSYNDR register  */
#define DVP_SSYNDR_FSDAT_POS                           (0U)
#define DVP_SSYNDR_FSDAT                               (0x000000FFUL)
#define DVP_SSYNDR_LSDAT_POS                           (8U)
#define DVP_SSYNDR_LSDAT                               (0x0000FF00UL)
#define DVP_SSYNDR_LEDAT_POS                           (16U)
#define DVP_SSYNDR_LEDAT                               (0x00FF0000UL)
#define DVP_SSYNDR_FEDAT_POS                           (24U)
#define DVP_SSYNDR_FEDAT                               (0xFF000000UL)

/*  Bit definition for DVP_SSYNMR register  */
#define DVP_SSYNMR_FSMSK_POS                           (0U)
#define DVP_SSYNMR_FSMSK                               (0x000000FFUL)
#define DVP_SSYNMR_LSMSK_POS                           (8U)
#define DVP_SSYNMR_LSMSK                               (0x0000FF00UL)
#define DVP_SSYNMR_LEMSK_POS                           (16U)
#define DVP_SSYNMR_LEMSK                               (0x00FF0000UL)
#define DVP_SSYNMR_FEMSK_POS                           (24U)
#define DVP_SSYNMR_FEMSK                               (0xFF000000UL)

/*  Bit definition for DVP_CPSFTR register  */
#define DVP_CPSFTR_RSHIFT_POS                          (0U)
#define DVP_CPSFTR_RSHIFT                              (0x00003FFFUL)
#define DVP_CPSFTR_CSHIFT_POS                          (16U)
#define DVP_CPSFTR_CSHIFT                              (0x3FFF0000UL)

