SoCXin/HC32F4A0/src/hc32f4a0sihb_template/common/hc32f4a0sihb.h
/*******************************************************************************
                Bit definition for Peripheral ETH
*******************************************************************************/
/*  Bit definition for ETH_MAC_IFCONFR register  */
#define ETH_MAC_IFCONFR_IFSEL_POS                      (0U)
#define ETH_MAC_IFCONFR_IFSEL                          (0x00000001UL)
#define ETH_MAC_IFCONFR_RCKINV_POS                     (4U)
#define ETH_MAC_IFCONFR_RCKINV                         (0x00000010UL)
#define ETH_MAC_IFCONFR_TCKINV_POS                     (5U)
#define ETH_MAC_IFCONFR_TCKINV                         (0x00000020UL)

/*  Bit definition for ETH_MAC_CONFIGR register  */
#define ETH_MAC_CONFIGR_RE_POS                         (2U)
#define ETH_MAC_CONFIGR_RE                             (0x00000004UL)
#define ETH_MAC_CONFIGR_TE_POS                         (3U)
#define ETH_MAC_CONFIGR_TE                             (0x00000008UL)
#define ETH_MAC_CONFIGR_DC_POS                         (4U)
#define ETH_MAC_CONFIGR_DC                             (0x00000010UL)
#define ETH_MAC_CONFIGR_BL_POS                         (5U)
#define ETH_MAC_CONFIGR_BL                             (0x00000060UL)
#define ETH_MAC_CONFIGR_BL_0                           (0x00000020UL)
#define ETH_MAC_CONFIGR_BL_1                           (0x00000040UL)
#define ETH_MAC_CONFIGR_ACS_POS                        (7U)
#define ETH_MAC_CONFIGR_ACS                            (0x00000080UL)
#define ETH_MAC_CONFIGR_DRTY_POS                       (9U)
#define ETH_MAC_CONFIGR_DRTY                           (0x00000200UL)
#define ETH_MAC_CONFIGR_IPCO_POS                       (10U)
#define ETH_MAC_CONFIGR_IPCO                           (0x00000400UL)
#define ETH_MAC_CONFIGR_DM_POS                         (11U)
#define ETH_MAC_CONFIGR_DM                             (0x00000800UL)
#define ETH_MAC_CONFIGR_LM_POS                         (12U)
#define ETH_MAC_CONFIGR_LM                             (0x00001000UL)
#define ETH_MAC_CONFIGR_DO_POS                         (13U)
#define ETH_MAC_CONFIGR_DO                             (0x00002000UL)
#define ETH_MAC_CONFIGR_FES_POS                        (14U)
#define ETH_MAC_CONFIGR_FES                            (0x00004000UL)
#define ETH_MAC_CONFIGR_DCRS_POS                       (16U)
#define ETH_MAC_CONFIGR_DCRS                           (0x00010000UL)
#define ETH_MAC_CONFIGR_IFG_POS                        (17U)
#define ETH_MAC_CONFIGR_IFG                            (0x000E0000UL)
#define ETH_MAC_CONFIGR_IFG_0                          (0x00020000UL)
#define ETH_MAC_CONFIGR_IFG_1                          (0x00040000UL)
#define ETH_MAC_CONFIGR_IFG_2                          (0x00080000UL)
#define ETH_MAC_CONFIGR_MJB_POS                        (22U)
#define ETH_MAC_CONFIGR_MJB                            (0x00400000UL)
#define ETH_MAC_CONFIGR_MWD_POS                        (23U)
#define ETH_MAC_CONFIGR_MWD                            (0x00800000UL)
#define ETH_MAC_CONFIGR_CST_POS                        (25U)
#define ETH_MAC_CONFIGR_CST                            (0x02000000UL)
#define ETH_MAC_CONFIGR_SAIRC_POS                      (28U)
#define ETH_MAC_CONFIGR_SAIRC                          (0x70000000UL)
#define ETH_MAC_CONFIGR_SAIRC_0                        (0x10000000UL)
#define ETH_MAC_CONFIGR_SAIRC_1                        (0x20000000UL)
#define ETH_MAC_CONFIGR_SAIRC_2                        (0x40000000UL)

/*  Bit definition for ETH_MAC_FLTCTLR register  */
#define ETH_MAC_FLTCTLR_PR_POS                         (0U)
#define ETH_MAC_FLTCTLR_PR                             (0x00000001UL)
#define ETH_MAC_FLTCTLR_HUC_POS                        (1U)
#define ETH_MAC_FLTCTLR_HUC                            (0x00000002UL)
#define ETH_MAC_FLTCTLR_HMC_POS                        (2U)
#define ETH_MAC_FLTCTLR_HMC                            (0x00000004UL)
#define ETH_MAC_FLTCTLR_DAIF_POS                       (3U)
#define ETH_MAC_FLTCTLR_DAIF                           (0x00000008UL)
#define ETH_MAC_FLTCTLR_PMF_POS                        (4U)
#define ETH_MAC_FLTCTLR_PMF                            (0x00000010UL)
#define ETH_MAC_FLTCTLR_DBF_POS                        (5U)
#define ETH_MAC_FLTCTLR_DBF                            (0x00000020UL)
#define ETH_MAC_FLTCTLR_PCF_POS                        (6U)
#define ETH_MAC_FLTCTLR_PCF                            (0x000000C0UL)
#define ETH_MAC_FLTCTLR_PCF_0                          (0x00000040UL)
#define ETH_MAC_FLTCTLR_PCF_1                          (0x00000080UL)
#define ETH_MAC_FLTCTLR_SAIF_POS                       (8U)
#define ETH_MAC_FLTCTLR_SAIF                           (0x00000100UL)
#define ETH_MAC_FLTCTLR_SAF_POS                        (9U)
#define ETH_MAC_FLTCTLR_SAF                            (0x00000200UL)
#define ETH_MAC_FLTCTLR_HPF_POS                        (10U)
#define ETH_MAC_FLTCTLR_HPF                            (0x00000400UL)
#define ETH_MAC_FLTCTLR_VTFE_POS                       (16U)
#define ETH_MAC_FLTCTLR_VTFE                           (0x00010000UL)
#define ETH_MAC_FLTCTLR_IPFE_POS                       (20U)
#define ETH_MAC_FLTCTLR_IPFE                           (0x00100000UL)
#define ETH_MAC_FLTCTLR_DNTU_POS                       (21U)
#define ETH_MAC_FLTCTLR_DNTU                           (0x00200000UL)
#define ETH_MAC_FLTCTLR_RA_POS                         (31U)
#define ETH_MAC_FLTCTLR_RA                             (0x80000000UL)

/*  Bit definition for ETH_MAC_HASHTHR register  */
#define ETH_MAC_HASHTHR_HTH                            (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_HASHTLR register  */
#define ETH_MAC_HASHTLR_HTL                            (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_SMIADDR register  */
#define ETH_MAC_SMIADDR_SMIB_POS                       (0U)
#define ETH_MAC_SMIADDR_SMIB                           (0x00000001UL)
#define ETH_MAC_SMIADDR_SMIW_POS                       (1U)
#define ETH_MAC_SMIADDR_SMIW                           (0x00000002UL)
#define ETH_MAC_SMIADDR_SMIC_POS                       (2U)
#define ETH_MAC_SMIADDR_SMIC                           (0x0000003CUL)
#define ETH_MAC_SMIADDR_SMIC_0                         (0x00000004UL)
#define ETH_MAC_SMIADDR_SMIC_1                         (0x00000008UL)
#define ETH_MAC_SMIADDR_SMIC_2                         (0x00000010UL)
#define ETH_MAC_SMIADDR_SMIC_3                         (0x00000020UL)
#define ETH_MAC_SMIADDR_SMIR_POS                       (6U)
#define ETH_MAC_SMIADDR_SMIR                           (0x000007C0UL)
#define ETH_MAC_SMIADDR_SMIR_0                         (0x00000040UL)
#define ETH_MAC_SMIADDR_SMIR_1                         (0x00000080UL)
#define ETH_MAC_SMIADDR_SMIR_2                         (0x00000100UL)
#define ETH_MAC_SMIADDR_SMIR_3                         (0x00000200UL)
#define ETH_MAC_SMIADDR_SMIR_4                         (0x00000400UL)
#define ETH_MAC_SMIADDR_SMIA_POS                       (11U)
#define ETH_MAC_SMIADDR_SMIA                           (0x0000F800UL)
#define ETH_MAC_SMIADDR_SMIA_0                         (0x00000800UL)
#define ETH_MAC_SMIADDR_SMIA_1                         (0x00001000UL)
#define ETH_MAC_SMIADDR_SMIA_2                         (0x00002000UL)
#define ETH_MAC_SMIADDR_SMIA_3                         (0x00004000UL)
#define ETH_MAC_SMIADDR_SMIA_4                         (0x00008000UL)

