SoCXin/HC32F4A0/src/hc32f4a0sihb_template/common/hc32f4a0sihb.h
/*  Bit definition for ETH_MAC_MACADHR0 register  */
#define ETH_MAC_MACADHR0_ADDRH0_POS                    (0U)
#define ETH_MAC_MACADHR0_ADDRH0                        (0x0000FFFFUL)
#define ETH_MAC_MACADHR0_AE0_POS                       (31U)
#define ETH_MAC_MACADHR0_AE0                           (0x80000000UL)

/*  Bit definition for ETH_MAC_MACADLR0 register  */
#define ETH_MAC_MACADLR0_ADDRL0                        (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_MACADHR1 register  */
#define ETH_MAC_MACADHR1_ADDRH1_POS                    (0U)
#define ETH_MAC_MACADHR1_ADDRH1                        (0x0000FFFFUL)
#define ETH_MAC_MACADHR1_MBC1_POS                      (24U)
#define ETH_MAC_MACADHR1_MBC1                          (0x3F000000UL)
#define ETH_MAC_MACADHR1_MBC1_0                        (0x01000000UL)
#define ETH_MAC_MACADHR1_MBC1_1                        (0x02000000UL)
#define ETH_MAC_MACADHR1_MBC1_2                        (0x04000000UL)
#define ETH_MAC_MACADHR1_MBC1_3                        (0x08000000UL)
#define ETH_MAC_MACADHR1_MBC1_4                        (0x10000000UL)
#define ETH_MAC_MACADHR1_MBC1_5                        (0x20000000UL)
#define ETH_MAC_MACADHR1_SA1_POS                       (30U)
#define ETH_MAC_MACADHR1_SA1                           (0x40000000UL)
#define ETH_MAC_MACADHR1_AE1_POS                       (31U)
#define ETH_MAC_MACADHR1_AE1                           (0x80000000UL)

/*  Bit definition for ETH_MAC_MACADLR1 register  */
#define ETH_MAC_MACADLR1_ADDRL1                        (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_MACADHR2 register  */
#define ETH_MAC_MACADHR2_ADDRH2_POS                    (0U)
#define ETH_MAC_MACADHR2_ADDRH2                        (0x0000FFFFUL)
#define ETH_MAC_MACADHR2_MBC2_POS                      (24U)
#define ETH_MAC_MACADHR2_MBC2                          (0x3F000000UL)
#define ETH_MAC_MACADHR2_MBC2_0                        (0x01000000UL)
#define ETH_MAC_MACADHR2_MBC2_1                        (0x02000000UL)
#define ETH_MAC_MACADHR2_MBC2_2                        (0x04000000UL)
#define ETH_MAC_MACADHR2_MBC2_3                        (0x08000000UL)
#define ETH_MAC_MACADHR2_MBC2_4                        (0x10000000UL)
#define ETH_MAC_MACADHR2_MBC2_5                        (0x20000000UL)
#define ETH_MAC_MACADHR2_SA2_POS                       (30U)
#define ETH_MAC_MACADHR2_SA2                           (0x40000000UL)
#define ETH_MAC_MACADHR2_AE2_POS                       (31U)
#define ETH_MAC_MACADHR2_AE2                           (0x80000000UL)

/*  Bit definition for ETH_MAC_MACADLR2 register  */
#define ETH_MAC_MACADLR2_ADDRL2                        (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_MACADHR3 register  */
#define ETH_MAC_MACADHR3_ADDRH3_POS                    (0U)
#define ETH_MAC_MACADHR3_ADDRH3                        (0x0000FFFFUL)
#define ETH_MAC_MACADHR3_MBC3_POS                      (24U)
#define ETH_MAC_MACADHR3_MBC3                          (0x3F000000UL)
#define ETH_MAC_MACADHR3_MBC3_0                        (0x01000000UL)
#define ETH_MAC_MACADHR3_MBC3_1                        (0x02000000UL)
#define ETH_MAC_MACADHR3_MBC3_2                        (0x04000000UL)
#define ETH_MAC_MACADHR3_MBC3_3                        (0x08000000UL)
#define ETH_MAC_MACADHR3_MBC3_4                        (0x10000000UL)
#define ETH_MAC_MACADHR3_MBC3_5                        (0x20000000UL)
#define ETH_MAC_MACADHR3_SA3_POS                       (30U)
#define ETH_MAC_MACADHR3_SA3                           (0x40000000UL)
#define ETH_MAC_MACADHR3_AE3_POS                       (31U)
#define ETH_MAC_MACADHR3_AE3                           (0x80000000UL)

/*  Bit definition for ETH_MAC_MACADLR3 register  */
#define ETH_MAC_MACADLR3_ADDRL3                        (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_MACADHR4 register  */
#define ETH_MAC_MACADHR4_ADDRH4_POS                    (0U)
#define ETH_MAC_MACADHR4_ADDRH4                        (0x0000FFFFUL)
#define ETH_MAC_MACADHR4_MBC4_POS                      (24U)
#define ETH_MAC_MACADHR4_MBC4                          (0x3F000000UL)
#define ETH_MAC_MACADHR4_MBC4_0                        (0x01000000UL)
#define ETH_MAC_MACADHR4_MBC4_1                        (0x02000000UL)
#define ETH_MAC_MACADHR4_MBC4_2                        (0x04000000UL)
#define ETH_MAC_MACADHR4_MBC4_3                        (0x08000000UL)
#define ETH_MAC_MACADHR4_MBC4_4                        (0x10000000UL)
#define ETH_MAC_MACADHR4_MBC4_5                        (0x20000000UL)
#define ETH_MAC_MACADHR4_SA4_POS                       (30U)
#define ETH_MAC_MACADHR4_SA4                           (0x40000000UL)
#define ETH_MAC_MACADHR4_AE4_POS                       (31U)
#define ETH_MAC_MACADHR4_AE4                           (0x80000000UL)

/*  Bit definition for ETH_MAC_MACADLR4 register  */
#define ETH_MAC_MACADLR4_ADDRL4                        (0xFFFFFFFFUL)

/*  Bit definition for ETH_MMC_MMCCTLR register  */
#define ETH_MMC_MMCCTLR_CRST_POS                       (0U)
#define ETH_MMC_MMCCTLR_CRST                           (0x00000001UL)
#define ETH_MMC_MMCCTLR_COS_POS                        (1U)
#define ETH_MMC_MMCCTLR_COS                            (0x00000002UL)
#define ETH_MMC_MMCCTLR_ROR_POS                        (2U)
#define ETH_MMC_MMCCTLR_ROR                            (0x00000004UL)
#define ETH_MMC_MMCCTLR_MCF_POS                        (3U)
#define ETH_MMC_MMCCTLR_MCF                            (0x00000008UL)
#define ETH_MMC_MMCCTLR_MCPSET_POS                     (4U)
#define ETH_MMC_MMCCTLR_MCPSET                         (0x00000010UL)
#define ETH_MMC_MMCCTLR_MCPSEL_POS                     (5U)
#define ETH_MMC_MMCCTLR_MCPSEL                         (0x00000020UL)

/*  Bit definition for ETH_MMC_REVSTSR register  */
#define ETH_MMC_REVSTSR_RXBGIS_POS                     (3U)
#define ETH_MMC_REVSTSR_RXBGIS                         (0x00000008UL)
#define ETH_MMC_REVSTSR_RXMGIS_POS                     (4U)
#define ETH_MMC_REVSTSR_RXMGIS                         (0x00000010UL)
#define ETH_MMC_REVSTSR_RXCEIS_POS                     (5U)
#define ETH_MMC_REVSTSR_RXCEIS                         (0x00000020UL)
#define ETH_MMC_REVSTSR_RXAEIS_POS                     (6U)
#define ETH_MMC_REVSTSR_RXAEIS                         (0x00000040UL)
#define ETH_MMC_REVSTSR_RXREIS_POS                     (7U)
#define ETH_MMC_REVSTSR_RXREIS                         (0x00000080UL)
#define ETH_MMC_REVSTSR_RXUGIS_POS                     (17U)
#define ETH_MMC_REVSTSR_RXUGIS                         (0x00020000UL)
#define ETH_MMC_REVSTSR_RXLEIS_POS                     (18U)
#define ETH_MMC_REVSTSR_RXLEIS                         (0x00040000UL)
#define ETH_MMC_REVSTSR_RXOEIS_POS                     (19U)
#define ETH_MMC_REVSTSR_RXOEIS                         (0x00080000UL)

/*  Bit definition for ETH_MMC_TRSSTSR register  */
#define ETH_MMC_TRSSTSR_TXBGIS_POS                     (2U)
#define ETH_MMC_TRSSTSR_TXBGIS                         (0x00000004UL)
#define ETH_MMC_TRSSTSR_TXMGIS_POS                     (3U)
#define ETH_MMC_TRSSTSR_TXMGIS                         (0x00000008UL)
#define ETH_MMC_TRSSTSR_TXDEEIS_POS                    (16U)
#define ETH_MMC_TRSSTSR_TXDEEIS                        (0x00010000UL)
#define ETH_MMC_TRSSTSR_TXLCEIS_POS                    (17U)
#define ETH_MMC_TRSSTSR_TXLCEIS                        (0x00020000UL)
#define ETH_MMC_TRSSTSR_TXECEIS_POS                    (18U)
#define ETH_MMC_TRSSTSR_TXECEIS                        (0x00040000UL)
#define ETH_MMC_TRSSTSR_TXCAEIS_POS                    (19U)
#define ETH_MMC_TRSSTSR_TXCAEIS                        (0x00080000UL)
#define ETH_MMC_TRSSTSR_TXUGIS_POS                     (21U)
#define ETH_MMC_TRSSTSR_TXUGIS                         (0x00200000UL)
#define ETH_MMC_TRSSTSR_TXEDEIS_POS                    (22U)
#define ETH_MMC_TRSSTSR_TXEDEIS                        (0x00400000UL)

/*  Bit definition for ETH_MMC_RITCTLR register  */
#define ETH_MMC_RITCTLR_RXBGIM_POS                     (3U)
#define ETH_MMC_RITCTLR_RXBGIM                         (0x00000008UL)
#define ETH_MMC_RITCTLR_RXMGIM_POS                     (4U)
#define ETH_MMC_RITCTLR_RXMGIM                         (0x00000010UL)
#define ETH_MMC_RITCTLR_RXCEIM_POS                     (5U)
#define ETH_MMC_RITCTLR_RXCEIM                         (0x00000020UL)
#define ETH_MMC_RITCTLR_RXAEIM_POS                     (6U)
#define ETH_MMC_RITCTLR_RXAEIM                         (0x00000040UL)
#define ETH_MMC_RITCTLR_RXREIM_POS                     (7U)
#define ETH_MMC_RITCTLR_RXREIM                         (0x00000080UL)
#define ETH_MMC_RITCTLR_RXUGIM_POS                     (17U)
#define ETH_MMC_RITCTLR_RXUGIM                         (0x00020000UL)
#define ETH_MMC_RITCTLR_RXLEIM_POS                     (18U)
#define ETH_MMC_RITCTLR_RXLEIM                         (0x00040000UL)
#define ETH_MMC_RITCTLR_RXOEIM_POS                     (19U)
#define ETH_MMC_RITCTLR_RXOEIM                         (0x00080000UL)

