SoCXin/HC32F4A0/src/hc32f4a0sihb_template/common/hc32f4a0sihb.h
/*  Bit definition for GPIO_PORRA register  */
#define GPIO_PORRA_POR00_POS                           (0U)
#define GPIO_PORRA_POR00                               (0x0001U)
#define GPIO_PORRA_POR01_POS                           (1U)
#define GPIO_PORRA_POR01                               (0x0002U)
#define GPIO_PORRA_POR02_POS                           (2U)
#define GPIO_PORRA_POR02                               (0x0004U)
#define GPIO_PORRA_POR03_POS                           (3U)
#define GPIO_PORRA_POR03                               (0x0008U)
#define GPIO_PORRA_POR04_POS                           (4U)
#define GPIO_PORRA_POR04                               (0x0010U)
#define GPIO_PORRA_POR05_POS                           (5U)
#define GPIO_PORRA_POR05                               (0x0020U)
#define GPIO_PORRA_POR06_POS                           (6U)
#define GPIO_PORRA_POR06                               (0x0040U)
#define GPIO_PORRA_POR07_POS                           (7U)
#define GPIO_PORRA_POR07                               (0x0080U)
#define GPIO_PORRA_POR08_POS                           (8U)
#define GPIO_PORRA_POR08                               (0x0100U)
#define GPIO_PORRA_POR09_POS                           (9U)
#define GPIO_PORRA_POR09                               (0x0200U)
#define GPIO_PORRA_POR10_POS                           (10U)
#define GPIO_PORRA_POR10                               (0x0400U)
#define GPIO_PORRA_POR11_POS                           (11U)
#define GPIO_PORRA_POR11                               (0x0800U)
#define GPIO_PORRA_POR12_POS                           (12U)
#define GPIO_PORRA_POR12                               (0x1000U)
#define GPIO_PORRA_POR13_POS                           (13U)
#define GPIO_PORRA_POR13                               (0x2000U)
#define GPIO_PORRA_POR14_POS                           (14U)
#define GPIO_PORRA_POR14                               (0x4000U)
#define GPIO_PORRA_POR15_POS                           (15U)
#define GPIO_PORRA_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRA register  */
#define GPIO_POTRA_POT00_POS                           (0U)
#define GPIO_POTRA_POT00                               (0x0001U)
#define GPIO_POTRA_POT01_POS                           (1U)
#define GPIO_POTRA_POT01                               (0x0002U)
#define GPIO_POTRA_POT02_POS                           (2U)
#define GPIO_POTRA_POT02                               (0x0004U)
#define GPIO_POTRA_POT03_POS                           (3U)
#define GPIO_POTRA_POT03                               (0x0008U)
#define GPIO_POTRA_POT04_POS                           (4U)
#define GPIO_POTRA_POT04                               (0x0010U)
#define GPIO_POTRA_POT05_POS                           (5U)
#define GPIO_POTRA_POT05                               (0x0020U)
#define GPIO_POTRA_POT06_POS                           (6U)
#define GPIO_POTRA_POT06                               (0x0040U)
#define GPIO_POTRA_POT07_POS                           (7U)
#define GPIO_POTRA_POT07                               (0x0080U)
#define GPIO_POTRA_POT08_POS                           (8U)
#define GPIO_POTRA_POT08                               (0x0100U)
#define GPIO_POTRA_POT09_POS                           (9U)
#define GPIO_POTRA_POT09                               (0x0200U)
#define GPIO_POTRA_POT10_POS                           (10U)
#define GPIO_POTRA_POT10                               (0x0400U)
#define GPIO_POTRA_POT11_POS                           (11U)
#define GPIO_POTRA_POT11                               (0x0800U)
#define GPIO_POTRA_POT12_POS                           (12U)
#define GPIO_POTRA_POT12                               (0x1000U)
#define GPIO_POTRA_POT13_POS                           (13U)
#define GPIO_POTRA_POT13                               (0x2000U)
#define GPIO_POTRA_POT14_POS                           (14U)
#define GPIO_POTRA_POT14                               (0x4000U)
#define GPIO_POTRA_POT15_POS                           (15U)
#define GPIO_POTRA_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRB register  */
#define GPIO_PIDRB_PIN00_POS                           (0U)
#define GPIO_PIDRB_PIN00                               (0x0001U)
#define GPIO_PIDRB_PIN01_POS                           (1U)
#define GPIO_PIDRB_PIN01                               (0x0002U)
#define GPIO_PIDRB_PIN02_POS                           (2U)
#define GPIO_PIDRB_PIN02                               (0x0004U)
#define GPIO_PIDRB_PIN03_POS                           (3U)
#define GPIO_PIDRB_PIN03                               (0x0008U)
#define GPIO_PIDRB_PIN04_POS                           (4U)
#define GPIO_PIDRB_PIN04                               (0x0010U)
#define GPIO_PIDRB_PIN05_POS                           (5U)
#define GPIO_PIDRB_PIN05                               (0x0020U)
#define GPIO_PIDRB_PIN06_POS                           (6U)
#define GPIO_PIDRB_PIN06                               (0x0040U)
#define GPIO_PIDRB_PIN07_POS                           (7U)
#define GPIO_PIDRB_PIN07                               (0x0080U)
#define GPIO_PIDRB_PIN08_POS                           (8U)
#define GPIO_PIDRB_PIN08                               (0x0100U)
#define GPIO_PIDRB_PIN09_POS                           (9U)
#define GPIO_PIDRB_PIN09                               (0x0200U)
#define GPIO_PIDRB_PIN10_POS                           (10U)
#define GPIO_PIDRB_PIN10                               (0x0400U)
#define GPIO_PIDRB_PIN11_POS                           (11U)
#define GPIO_PIDRB_PIN11                               (0x0800U)
#define GPIO_PIDRB_PIN12_POS                           (12U)
#define GPIO_PIDRB_PIN12                               (0x1000U)
#define GPIO_PIDRB_PIN13_POS                           (13U)
#define GPIO_PIDRB_PIN13                               (0x2000U)
#define GPIO_PIDRB_PIN14_POS                           (14U)
#define GPIO_PIDRB_PIN14                               (0x4000U)
#define GPIO_PIDRB_PIN15_POS                           (15U)
#define GPIO_PIDRB_PIN15                               (0x8000U)

/*  Bit definition for GPIO_PODRB register  */
#define GPIO_PODRB_POUT00_POS                          (0U)
#define GPIO_PODRB_POUT00                              (0x0001U)
#define GPIO_PODRB_POUT01_POS                          (1U)
#define GPIO_PODRB_POUT01                              (0x0002U)
#define GPIO_PODRB_POUT02_POS                          (2U)
#define GPIO_PODRB_POUT02                              (0x0004U)
#define GPIO_PODRB_POUT03_POS                          (3U)
#define GPIO_PODRB_POUT03                              (0x0008U)
#define GPIO_PODRB_POUT04_POS                          (4U)
#define GPIO_PODRB_POUT04                              (0x0010U)
#define GPIO_PODRB_POUT05_POS                          (5U)
#define GPIO_PODRB_POUT05                              (0x0020U)
#define GPIO_PODRB_POUT06_POS                          (6U)
#define GPIO_PODRB_POUT06                              (0x0040U)
#define GPIO_PODRB_POUT07_POS                          (7U)
#define GPIO_PODRB_POUT07                              (0x0080U)
#define GPIO_PODRB_POUT08_POS                          (8U)
#define GPIO_PODRB_POUT08                              (0x0100U)
#define GPIO_PODRB_POUT09_POS                          (9U)
#define GPIO_PODRB_POUT09                              (0x0200U)
#define GPIO_PODRB_POUT10_POS                          (10U)
#define GPIO_PODRB_POUT10                              (0x0400U)
#define GPIO_PODRB_POUT11_POS                          (11U)
#define GPIO_PODRB_POUT11                              (0x0800U)
#define GPIO_PODRB_POUT12_POS                          (12U)
#define GPIO_PODRB_POUT12                              (0x1000U)
#define GPIO_PODRB_POUT13_POS                          (13U)
#define GPIO_PODRB_POUT13                              (0x2000U)
#define GPIO_PODRB_POUT14_POS                          (14U)
#define GPIO_PODRB_POUT14                              (0x4000U)
#define GPIO_PODRB_POUT15_POS                          (15U)
#define GPIO_PODRB_POUT15                              (0x8000U)

