SoCXin/HC32F4A0/src/hc32f4a0sihb_template/common/hc32f4a0sihb.h
/*  Bit definition for GPIO_POERE register  */
#define GPIO_POERE_POUTE00_POS                         (0U)
#define GPIO_POERE_POUTE00                             (0x0001U)
#define GPIO_POERE_POUTE01_POS                         (1U)
#define GPIO_POERE_POUTE01                             (0x0002U)
#define GPIO_POERE_POUTE02_POS                         (2U)
#define GPIO_POERE_POUTE02                             (0x0004U)
#define GPIO_POERE_POUTE03_POS                         (3U)
#define GPIO_POERE_POUTE03                             (0x0008U)
#define GPIO_POERE_POUTE04_POS                         (4U)
#define GPIO_POERE_POUTE04                             (0x0010U)
#define GPIO_POERE_POUTE05_POS                         (5U)
#define GPIO_POERE_POUTE05                             (0x0020U)
#define GPIO_POERE_POUTE06_POS                         (6U)
#define GPIO_POERE_POUTE06                             (0x0040U)
#define GPIO_POERE_POUTE07_POS                         (7U)
#define GPIO_POERE_POUTE07                             (0x0080U)
#define GPIO_POERE_POUTE08_POS                         (8U)
#define GPIO_POERE_POUTE08                             (0x0100U)
#define GPIO_POERE_POUTE09_POS                         (9U)
#define GPIO_POERE_POUTE09                             (0x0200U)
#define GPIO_POERE_POUTE10_POS                         (10U)
#define GPIO_POERE_POUTE10                             (0x0400U)
#define GPIO_POERE_POUTE11_POS                         (11U)
#define GPIO_POERE_POUTE11                             (0x0800U)
#define GPIO_POERE_POUTE12_POS                         (12U)
#define GPIO_POERE_POUTE12                             (0x1000U)
#define GPIO_POERE_POUTE13_POS                         (13U)
#define GPIO_POERE_POUTE13                             (0x2000U)
#define GPIO_POERE_POUTE14_POS                         (14U)
#define GPIO_POERE_POUTE14                             (0x4000U)
#define GPIO_POERE_POUTE15_POS                         (15U)
#define GPIO_POERE_POUTE15                             (0x8000U)

/*  Bit definition for GPIO_POSRE register  */
#define GPIO_POSRE_POS00_POS                           (0U)
#define GPIO_POSRE_POS00                               (0x0001U)
#define GPIO_POSRE_POS01_POS                           (1U)
#define GPIO_POSRE_POS01                               (0x0002U)
#define GPIO_POSRE_POS02_POS                           (2U)
#define GPIO_POSRE_POS02                               (0x0004U)
#define GPIO_POSRE_POS03_POS                           (3U)
#define GPIO_POSRE_POS03                               (0x0008U)
#define GPIO_POSRE_POS04_POS                           (4U)
#define GPIO_POSRE_POS04                               (0x0010U)
#define GPIO_POSRE_POS05_POS                           (5U)
#define GPIO_POSRE_POS05                               (0x0020U)
#define GPIO_POSRE_POS06_POS                           (6U)
#define GPIO_POSRE_POS06                               (0x0040U)
#define GPIO_POSRE_POS07_POS                           (7U)
#define GPIO_POSRE_POS07                               (0x0080U)
#define GPIO_POSRE_POS08_POS                           (8U)
#define GPIO_POSRE_POS08                               (0x0100U)
#define GPIO_POSRE_POS09_POS                           (9U)
#define GPIO_POSRE_POS09                               (0x0200U)
#define GPIO_POSRE_POS10_POS                           (10U)
#define GPIO_POSRE_POS10                               (0x0400U)
#define GPIO_POSRE_POS11_POS                           (11U)
#define GPIO_POSRE_POS11                               (0x0800U)
#define GPIO_POSRE_POS12_POS                           (12U)
#define GPIO_POSRE_POS12                               (0x1000U)
#define GPIO_POSRE_POS13_POS                           (13U)
#define GPIO_POSRE_POS13                               (0x2000U)
#define GPIO_POSRE_POS14_POS                           (14U)
#define GPIO_POSRE_POS14                               (0x4000U)
#define GPIO_POSRE_POS15_POS                           (15U)
#define GPIO_POSRE_POS15                               (0x8000U)

/*  Bit definition for GPIO_PORRE register  */
#define GPIO_PORRE_POR00_POS                           (0U)
#define GPIO_PORRE_POR00                               (0x0001U)
#define GPIO_PORRE_POR01_POS                           (1U)
#define GPIO_PORRE_POR01                               (0x0002U)
#define GPIO_PORRE_POR02_POS                           (2U)
#define GPIO_PORRE_POR02                               (0x0004U)
#define GPIO_PORRE_POR03_POS                           (3U)
#define GPIO_PORRE_POR03                               (0x0008U)
#define GPIO_PORRE_POR04_POS                           (4U)
#define GPIO_PORRE_POR04                               (0x0010U)
#define GPIO_PORRE_POR05_POS                           (5U)
#define GPIO_PORRE_POR05                               (0x0020U)
#define GPIO_PORRE_POR06_POS                           (6U)
#define GPIO_PORRE_POR06                               (0x0040U)
#define GPIO_PORRE_POR07_POS                           (7U)
#define GPIO_PORRE_POR07                               (0x0080U)
#define GPIO_PORRE_POR08_POS                           (8U)
#define GPIO_PORRE_POR08                               (0x0100U)
#define GPIO_PORRE_POR09_POS                           (9U)
#define GPIO_PORRE_POR09                               (0x0200U)
#define GPIO_PORRE_POR10_POS                           (10U)
#define GPIO_PORRE_POR10                               (0x0400U)
#define GPIO_PORRE_POR11_POS                           (11U)
#define GPIO_PORRE_POR11                               (0x0800U)
#define GPIO_PORRE_POR12_POS                           (12U)
#define GPIO_PORRE_POR12                               (0x1000U)
#define GPIO_PORRE_POR13_POS                           (13U)
#define GPIO_PORRE_POR13                               (0x2000U)
#define GPIO_PORRE_POR14_POS                           (14U)
#define GPIO_PORRE_POR14                               (0x4000U)
#define GPIO_PORRE_POR15_POS                           (15U)
#define GPIO_PORRE_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRE register  */
#define GPIO_POTRE_POT00_POS                           (0U)
#define GPIO_POTRE_POT00                               (0x0001U)
#define GPIO_POTRE_POT01_POS                           (1U)
#define GPIO_POTRE_POT01                               (0x0002U)
#define GPIO_POTRE_POT02_POS                           (2U)
#define GPIO_POTRE_POT02                               (0x0004U)
#define GPIO_POTRE_POT03_POS                           (3U)
#define GPIO_POTRE_POT03                               (0x0008U)
#define GPIO_POTRE_POT04_POS                           (4U)
#define GPIO_POTRE_POT04                               (0x0010U)
#define GPIO_POTRE_POT05_POS                           (5U)
#define GPIO_POTRE_POT05                               (0x0020U)
#define GPIO_POTRE_POT06_POS                           (6U)
#define GPIO_POTRE_POT06                               (0x0040U)
#define GPIO_POTRE_POT07_POS                           (7U)
#define GPIO_POTRE_POT07                               (0x0080U)
#define GPIO_POTRE_POT08_POS                           (8U)
#define GPIO_POTRE_POT08                               (0x0100U)
#define GPIO_POTRE_POT09_POS                           (9U)
#define GPIO_POTRE_POT09                               (0x0200U)
#define GPIO_POTRE_POT10_POS                           (10U)
#define GPIO_POTRE_POT10                               (0x0400U)
#define GPIO_POTRE_POT11_POS                           (11U)
#define GPIO_POTRE_POT11                               (0x0800U)
#define GPIO_POTRE_POT12_POS                           (12U)
#define GPIO_POTRE_POT12                               (0x1000U)
#define GPIO_POTRE_POT13_POS                           (13U)
#define GPIO_POTRE_POT13                               (0x2000U)
#define GPIO_POTRE_POT14_POS                           (14U)
#define GPIO_POTRE_POT14                               (0x4000U)
#define GPIO_POTRE_POT15_POS                           (15U)
#define GPIO_POTRE_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRF register  */
#define GPIO_PIDRF_PIN00_POS                           (0U)
#define GPIO_PIDRF_PIN00                               (0x0001U)
#define GPIO_PIDRF_PIN01_POS                           (1U)
#define GPIO_PIDRF_PIN01                               (0x0002U)
#define GPIO_PIDRF_PIN02_POS                           (2U)
#define GPIO_PIDRF_PIN02                               (0x0004U)
#define GPIO_PIDRF_PIN03_POS                           (3U)
#define GPIO_PIDRF_PIN03                               (0x0008U)
#define GPIO_PIDRF_PIN04_POS                           (4U)
#define GPIO_PIDRF_PIN04                               (0x0010U)
#define GPIO_PIDRF_PIN05_POS                           (5U)
#define GPIO_PIDRF_PIN05                               (0x0020U)
#define GPIO_PIDRF_PIN06_POS                           (6U)
#define GPIO_PIDRF_PIN06                               (0x0040U)
#define GPIO_PIDRF_PIN07_POS                           (7U)
#define GPIO_PIDRF_PIN07                               (0x0080U)
#define GPIO_PIDRF_PIN08_POS                           (8U)
#define GPIO_PIDRF_PIN08                               (0x0100U)
#define GPIO_PIDRF_PIN09_POS                           (9U)
#define GPIO_PIDRF_PIN09                               (0x0200U)
#define GPIO_PIDRF_PIN10_POS                           (10U)
#define GPIO_PIDRF_PIN10                               (0x0400U)
#define GPIO_PIDRF_PIN11_POS                           (11U)
#define GPIO_PIDRF_PIN11                               (0x0800U)
#define GPIO_PIDRF_PIN12_POS                           (12U)
#define GPIO_PIDRF_PIN12                               (0x1000U)
#define GPIO_PIDRF_PIN13_POS                           (13U)
#define GPIO_PIDRF_PIN13                               (0x2000U)
#define GPIO_PIDRF_PIN14_POS                           (14U)
#define GPIO_PIDRF_PIN14                               (0x4000U)
#define GPIO_PIDRF_PIN15_POS                           (15U)
#define GPIO_PIDRF_PIN15                               (0x8000U)

/*  Bit definition for GPIO_PODRF register  */
#define GPIO_PODRF_POUT00_POS                          (0U)
#define GPIO_PODRF_POUT00                              (0x0001U)
#define GPIO_PODRF_POUT01_POS                          (1U)
#define GPIO_PODRF_POUT01                              (0x0002U)
#define GPIO_PODRF_POUT02_POS                          (2U)
#define GPIO_PODRF_POUT02                              (0x0004U)
#define GPIO_PODRF_POUT03_POS                          (3U)
#define GPIO_PODRF_POUT03                              (0x0008U)
#define GPIO_PODRF_POUT04_POS                          (4U)
#define GPIO_PODRF_POUT04                              (0x0010U)
#define GPIO_PODRF_POUT05_POS                          (5U)
#define GPIO_PODRF_POUT05                              (0x0020U)
#define GPIO_PODRF_POUT06_POS                          (6U)
#define GPIO_PODRF_POUT06                              (0x0040U)
#define GPIO_PODRF_POUT07_POS                          (7U)
#define GPIO_PODRF_POUT07                              (0x0080U)
#define GPIO_PODRF_POUT08_POS                          (8U)
#define GPIO_PODRF_POUT08                              (0x0100U)
#define GPIO_PODRF_POUT09_POS                          (9U)
#define GPIO_PODRF_POUT09                              (0x0200U)
#define GPIO_PODRF_POUT10_POS                          (10U)
#define GPIO_PODRF_POUT10                              (0x0400U)
#define GPIO_PODRF_POUT11_POS                          (11U)
#define GPIO_PODRF_POUT11                              (0x0800U)
#define GPIO_PODRF_POUT12_POS                          (12U)
#define GPIO_PODRF_POUT12                              (0x1000U)
#define GPIO_PODRF_POUT13_POS                          (13U)
#define GPIO_PODRF_POUT13                              (0x2000U)
#define GPIO_PODRF_POUT14_POS                          (14U)
#define GPIO_PODRF_POUT14                              (0x4000U)
#define GPIO_PODRF_POUT15_POS                          (15U)
#define GPIO_PODRF_POUT15                              (0x8000U)

/*  Bit definition for GPIO_POERF register  */
#define GPIO_POERF_POUTE00_POS                         (0U)
#define GPIO_POERF_POUTE00                             (0x0001U)
#define GPIO_POERF_POUTE01_POS                         (1U)
#define GPIO_POERF_POUTE01                             (0x0002U)
#define GPIO_POERF_POUTE02_POS                         (2U)
#define GPIO_POERF_POUTE02                             (0x0004U)
#define GPIO_POERF_POUTE03_POS                         (3U)
#define GPIO_POERF_POUTE03                             (0x0008U)
#define GPIO_POERF_POUTE04_POS                         (4U)
#define GPIO_POERF_POUTE04                             (0x0010U)
#define GPIO_POERF_POUTE05_POS                         (5U)
#define GPIO_POERF_POUTE05                             (0x0020U)
#define GPIO_POERF_POUTE06_POS                         (6U)
#define GPIO_POERF_POUTE06                             (0x0040U)
#define GPIO_POERF_POUTE07_POS                         (7U)
#define GPIO_POERF_POUTE07                             (0x0080U)
#define GPIO_POERF_POUTE08_POS                         (8U)
#define GPIO_POERF_POUTE08                             (0x0100U)
#define GPIO_POERF_POUTE09_POS                         (9U)
#define GPIO_POERF_POUTE09                             (0x0200U)
#define GPIO_POERF_POUTE10_POS                         (10U)
#define GPIO_POERF_POUTE10                             (0x0400U)
#define GPIO_POERF_POUTE11_POS                         (11U)
#define GPIO_POERF_POUTE11                             (0x0800U)
#define GPIO_POERF_POUTE12_POS                         (12U)
#define GPIO_POERF_POUTE12                             (0x1000U)
#define GPIO_POERF_POUTE13_POS                         (13U)
#define GPIO_POERF_POUTE13                             (0x2000U)
#define GPIO_POERF_POUTE14_POS                         (14U)
#define GPIO_POERF_POUTE14                             (0x4000U)
#define GPIO_POERF_POUTE15_POS                         (15U)
#define GPIO_POERF_POUTE15                             (0x8000U)

/*  Bit definition for GPIO_POSRF register  */
#define GPIO_POSRF_POS00_POS                           (0U)
#define GPIO_POSRF_POS00                               (0x0001U)
#define GPIO_POSRF_POS01_POS                           (1U)
#define GPIO_POSRF_POS01                               (0x0002U)
#define GPIO_POSRF_POS02_POS                           (2U)
#define GPIO_POSRF_POS02                               (0x0004U)
#define GPIO_POSRF_POS03_POS                           (3U)
#define GPIO_POSRF_POS03                               (0x0008U)
#define GPIO_POSRF_POS04_POS                           (4U)
#define GPIO_POSRF_POS04                               (0x0010U)
#define GPIO_POSRF_POS05_POS                           (5U)
#define GPIO_POSRF_POS05                               (0x0020U)
#define GPIO_POSRF_POS06_POS                           (6U)
#define GPIO_POSRF_POS06                               (0x0040U)
#define GPIO_POSRF_POS07_POS                           (7U)
#define GPIO_POSRF_POS07                               (0x0080U)
#define GPIO_POSRF_POS08_POS                           (8U)
#define GPIO_POSRF_POS08                               (0x0100U)
#define GPIO_POSRF_POS09_POS                           (9U)
#define GPIO_POSRF_POS09                               (0x0200U)
#define GPIO_POSRF_POS10_POS                           (10U)
#define GPIO_POSRF_POS10                               (0x0400U)
#define GPIO_POSRF_POS11_POS                           (11U)
#define GPIO_POSRF_POS11                               (0x0800U)
#define GPIO_POSRF_POS12_POS                           (12U)
#define GPIO_POSRF_POS12                               (0x1000U)
#define GPIO_POSRF_POS13_POS                           (13U)
#define GPIO_POSRF_POS13                               (0x2000U)
#define GPIO_POSRF_POS14_POS                           (14U)
#define GPIO_POSRF_POS14                               (0x4000U)
#define GPIO_POSRF_POS15_POS                           (15U)
#define GPIO_POSRF_POS15                               (0x8000U)

