SoCXin/HC32F4A0/src/hc32f4a0sihb_template/common/hc32f4a0sihb.h
/*  Bit definition for PWC_FCG3 register  */
#define PWC_FCG3_ADC1_POS                              (0U)
#define PWC_FCG3_ADC1                                  (0x00000001UL)
#define PWC_FCG3_ADC2_POS                              (1U)
#define PWC_FCG3_ADC2                                  (0x00000002UL)
#define PWC_FCG3_ADC3_POS                              (2U)
#define PWC_FCG3_ADC3                                  (0x00000004UL)
#define PWC_FCG3_CMBIAS_POS                            (3U)
#define PWC_FCG3_CMBIAS                                (0x00000008UL)
#define PWC_FCG3_DAC1_POS                              (4U)
#define PWC_FCG3_DAC1                                  (0x00000010UL)
#define PWC_FCG3_DAC2_POS                              (5U)
#define PWC_FCG3_DAC2                                  (0x00000020UL)
#define PWC_FCG3_CMP1_POS                              (8U)
#define PWC_FCG3_CMP1                                  (0x00000100UL)
#define PWC_FCG3_CMP2_POS                              (9U)
#define PWC_FCG3_CMP2                                  (0x00000200UL)
#define PWC_FCG3_OTS_POS                               (12U)
#define PWC_FCG3_OTS                                   (0x00001000UL)
#define PWC_FCG3_DVP_POS                               (15U)
#define PWC_FCG3_DVP                                   (0x00008000UL)
#define PWC_FCG3_SMC_POS                               (16U)
#define PWC_FCG3_SMC                                   (0x00010000UL)
#define PWC_FCG3_DMC_POS                               (17U)
#define PWC_FCG3_DMC                                   (0x00020000UL)
#define PWC_FCG3_NFC_POS                               (18U)
#define PWC_FCG3_NFC                                   (0x00040000UL)
#define PWC_FCG3_USART1_POS                            (20U)
#define PWC_FCG3_USART1                                (0x00100000UL)
#define PWC_FCG3_USART2_POS                            (21U)
#define PWC_FCG3_USART2                                (0x00200000UL)
#define PWC_FCG3_USART3_POS                            (22U)
#define PWC_FCG3_USART3                                (0x00400000UL)
#define PWC_FCG3_USART4_POS                            (23U)
#define PWC_FCG3_USART4                                (0x00800000UL)
#define PWC_FCG3_USART5_POS                            (24U)
#define PWC_FCG3_USART5                                (0x01000000UL)
#define PWC_FCG3_USART6_POS                            (25U)
#define PWC_FCG3_USART6                                (0x02000000UL)
#define PWC_FCG3_USART7_POS                            (26U)
#define PWC_FCG3_USART7                                (0x04000000UL)
#define PWC_FCG3_USART8_POS                            (27U)
#define PWC_FCG3_USART8                                (0x08000000UL)
#define PWC_FCG3_USART9_POS                            (28U)
#define PWC_FCG3_USART9                                (0x10000000UL)
#define PWC_FCG3_USART10_POS                           (29U)
#define PWC_FCG3_USART10                               (0x20000000UL)

/*  Bit definition for PWC_FCG0PC register  */
#define PWC_FCG0PC_PRT0_POS                            (0U)
#define PWC_FCG0PC_PRT0                                (0x00000001UL)
#define PWC_FCG0PC_FCG0PCWE_POS                        (16U)
#define PWC_FCG0PC_FCG0PCWE                            (0xFFFF0000UL)

/*  Bit definition for PWC_VBATRSTR register  */
#define PWC_VBATRSTR                                   (0xFFU)

/*  Bit definition for PWC_VBATCR register  */
#define PWC_VBATCR_VBTRSD_POS                          (0U)
#define PWC_VBATCR_VBTRSD                              (0x01U)
#define PWC_VBATCR_RAMVALID_POS                        (1U)
#define PWC_VBATCR_RAMVALID                            (0x02U)
#define PWC_VBATCR_RAMPDF_POS                          (2U)
#define PWC_VBATCR_RAMPDF                              (0x04U)
#define PWC_VBATCR_VBATDIVMONE_POS                     (3U)
#define PWC_VBATCR_VBATDIVMONE                         (0x08U)
#define PWC_VBATCR_CSDIS_POS                           (7U)
#define PWC_VBATCR_CSDIS                               (0x80U)

/*  Bit definition for PWC_WKTC0 register  */
#define PWC_WKTC0_WKTMCMP                              (0xFFU)

/*  Bit definition for PWC_WKTC1 register  */
#define PWC_WKTC1_WKTMCMP                              (0x0FU)

/*  Bit definition for PWC_WKTC2 register  */
#define PWC_WKTC2_WKOVF_POS                            (4U)
#define PWC_WKTC2_WKOVF                                (0x10U)
#define PWC_WKTC2_WKCKS_POS                            (5U)
#define PWC_WKTC2_WKCKS                                (0x60U)
#define PWC_WKTC2_WKCKS_0                              (0x20U)
#define PWC_WKTC2_WKCKS_1                              (0x40U)
#define PWC_WKTC2_WKTCE_POS                            (7U)
#define PWC_WKTC2_WKTCE                                (0x80U)

/*  Bit definition for PWC_BKR0 register  */
#define PWC_BKR0                                       (0xFFU)

/*  Bit definition for PWC_BKR1 register  */
#define PWC_BKR1                                       (0xFFU)

/*  Bit definition for PWC_BKR2 register  */
#define PWC_BKR2                                       (0xFFU)

/*  Bit definition for PWC_BKR3 register  */
#define PWC_BKR3                                       (0xFFU)

/*  Bit definition for PWC_BKR4 register  */
#define PWC_BKR4                                       (0xFFU)

/*  Bit definition for PWC_BKR5 register  */
#define PWC_BKR5                                       (0xFFU)

/*  Bit definition for PWC_BKR6 register  */
#define PWC_BKR6                                       (0xFFU)

/*  Bit definition for PWC_BKR7 register  */
#define PWC_BKR7                                       (0xFFU)

/*  Bit definition for PWC_BKR8 register  */
#define PWC_BKR8                                       (0xFFU)

/*  Bit definition for PWC_BKR9 register  */
#define PWC_BKR9                                       (0xFFU)

/*  Bit definition for PWC_BKR10 register  */
#define PWC_BKR10                                      (0xFFU)

/*  Bit definition for PWC_BKR11 register  */
#define PWC_BKR11                                      (0xFFU)

/*  Bit definition for PWC_BKR12 register  */
#define PWC_BKR12                                      (0xFFU)

