SoCXin/HC32F4A0/src/hc32f4a0sihb_template/common/hc32f4a0sihb.h
typedef struct
{
    __IO uint32_t S1RG0WP;
    __IO uint32_t S1RG1WP;
    __IO uint32_t S1RG2WP;
    __IO uint32_t S1RG3WP;
    __IO uint32_t S1RG4WP;
    __IO uint32_t S1RG5WP;
    __IO uint32_t S1RG6WP;
    __IO uint32_t S1RG7WP;
    __IO uint32_t S1RG8WP;
    __IO uint32_t S1RG9WP;
    __IO uint32_t S1RG10WP;
    __IO uint32_t S1RG11WP;
    __IO uint32_t S1RG12WP;
    __IO uint32_t S1RG13WP;
    __IO uint32_t S1RG14WP;
    __IO uint32_t S1RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_s1rgwp_bit_t;

typedef struct
{
    __IO uint32_t S1RG0RP;
    __IO uint32_t S1RG1RP;
    __IO uint32_t S1RG2RP;
    __IO uint32_t S1RG3RP;
    __IO uint32_t S1RG4RP;
    __IO uint32_t S1RG5RP;
    __IO uint32_t S1RG6RP;
    __IO uint32_t S1RG7RP;
    __IO uint32_t S1RG8RP;
    __IO uint32_t S1RG9RP;
    __IO uint32_t S1RG10RP;
    __IO uint32_t S1RG11RP;
    __IO uint32_t S1RG12RP;
    __IO uint32_t S1RG13RP;
    __IO uint32_t S1RG14RP;
    __IO uint32_t S1RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_s1rgrp_bit_t;

typedef struct
{
    __IO uint32_t SMPU1BRP;
    __IO uint32_t SMPU1BWP;
    __IO uint32_t SMPU1ACT0;
    __IO uint32_t SMPU1ACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t SMPU1E;
    uint32_t RESERVED1[24];
} stc_mpu_s1cr_bit_t;

typedef struct
{
    __IO uint32_t S2RG0E;
    __IO uint32_t S2RG1E;
    __IO uint32_t S2RG2E;
    __IO uint32_t S2RG3E;
    __IO uint32_t S2RG4E;
    __IO uint32_t S2RG5E;
    __IO uint32_t S2RG6E;
    __IO uint32_t S2RG7E;
    __IO uint32_t S2RG8E;
    __IO uint32_t S2RG9E;
    __IO uint32_t S2RG10E;
    __IO uint32_t S2RG11E;
    __IO uint32_t S2RG12E;
    __IO uint32_t S2RG13E;
    __IO uint32_t S2RG14E;
    __IO uint32_t S2RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_s2rge_bit_t;

typedef struct
{
    __IO uint32_t S2RG0WP;
    __IO uint32_t S2RG1WP;
    __IO uint32_t S2RG2WP;
    __IO uint32_t S2RG3WP;
    __IO uint32_t S2RG4WP;
    __IO uint32_t S2RG5WP;
    __IO uint32_t S2RG6WP;
    __IO uint32_t S2RG7WP;
    __IO uint32_t S2RG8WP;
    __IO uint32_t S2RG9WP;
    __IO uint32_t S2RG10WP;
    __IO uint32_t S2RG11WP;
    __IO uint32_t S2RG12WP;
    __IO uint32_t S2RG13WP;
    __IO uint32_t S2RG14WP;
    __IO uint32_t S2RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_s2rgwp_bit_t;

typedef struct
{
    __IO uint32_t S2RG0RP;
    __IO uint32_t S2RG1RP;
    __IO uint32_t S2RG2RP;
    __IO uint32_t S2RG3RP;
    __IO uint32_t S2RG4RP;
    __IO uint32_t S2RG5RP;
    __IO uint32_t S2RG6RP;
    __IO uint32_t S2RG7RP;
    __IO uint32_t S2RG8RP;
    __IO uint32_t S2RG9RP;
    __IO uint32_t S2RG10RP;
    __IO uint32_t S2RG11RP;
    __IO uint32_t S2RG12RP;
    __IO uint32_t S2RG13RP;
    __IO uint32_t S2RG14RP;
    __IO uint32_t S2RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_s2rgrp_bit_t;

typedef struct
{
    __IO uint32_t SMPU2BRP;
    __IO uint32_t SMPU2BWP;
    __IO uint32_t SMPU2ACT0;
    __IO uint32_t SMPU2ACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t SMPU2E;
    uint32_t RESERVED1[24];
} stc_mpu_s2cr_bit_t;

typedef struct
{
    __IO uint32_t FRG0E;
    __IO uint32_t FRG1E;
    __IO uint32_t FRG2E;
    __IO uint32_t FRG3E;
    __IO uint32_t FRG4E;
    __IO uint32_t FRG5E;
    __IO uint32_t FRG6E;
    __IO uint32_t FRG7E;
    uint32_t RESERVED0[24];
} stc_mpu_frge_bit_t;

typedef struct
{
    __IO uint32_t FRG0WP;
    __IO uint32_t FRG1WP;
    __IO uint32_t FRG2WP;
    __IO uint32_t FRG3WP;
    __IO uint32_t FRG4WP;
    __IO uint32_t FRG5WP;
    __IO uint32_t FRG6WP;
    __IO uint32_t FRG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_frgwp_bit_t;

typedef struct
{
    __IO uint32_t FRG0RP;
    __IO uint32_t FRG1RP;
    __IO uint32_t FRG2RP;
    __IO uint32_t FRG3RP;
    __IO uint32_t FRG4RP;
    __IO uint32_t FRG5RP;
    __IO uint32_t FRG6RP;
    __IO uint32_t FRG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_frgrp_bit_t;

typedef struct
{
    __IO uint32_t FMPUBRP;
    __IO uint32_t FMPUBWP;
    __IO uint32_t FMPUACT0;
    __IO uint32_t FMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t FMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_fcr_bit_t;

typedef struct
{
    __IO uint32_t HRG0E;
    __IO uint32_t HRG1E;
    __IO uint32_t HRG2E;
    __IO uint32_t HRG3E;
    __IO uint32_t HRG4E;
    __IO uint32_t HRG5E;
    __IO uint32_t HRG6E;
    __IO uint32_t HRG7E;
    uint32_t RESERVED0[24];
} stc_mpu_hrge_bit_t;

typedef struct
{
    __IO uint32_t HRG0WP;
    __IO uint32_t HRG1WP;
    __IO uint32_t HRG2WP;
    __IO uint32_t HRG3WP;
    __IO uint32_t HRG4WP;
    __IO uint32_t HRG5WP;
    __IO uint32_t HRG6WP;
    __IO uint32_t HRG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_hrgwp_bit_t;

typedef struct
{
    __IO uint32_t HRG0RP;
    __IO uint32_t HRG1RP;
    __IO uint32_t HRG2RP;
    __IO uint32_t HRG3RP;
    __IO uint32_t HRG4RP;
    __IO uint32_t HRG5RP;
    __IO uint32_t HRG6RP;
    __IO uint32_t HRG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_hrgrp_bit_t;

typedef struct
{
    __IO uint32_t HMPUBRP;
    __IO uint32_t HMPUBWP;
    __IO uint32_t HMPUACT0;
    __IO uint32_t HMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t HMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_hcr_bit_t;

typedef struct
{
    __IO uint32_t ERG0E;
    __IO uint32_t ERG1E;
    __IO uint32_t ERG2E;
    __IO uint32_t ERG3E;
    __IO uint32_t ERG4E;
    __IO uint32_t ERG5E;
    __IO uint32_t ERG6E;
    __IO uint32_t ERG7E;
    uint32_t RESERVED0[24];
} stc_mpu_erge_bit_t;

typedef struct
{
    __IO uint32_t ERG0WP;
    __IO uint32_t ERG1WP;
    __IO uint32_t ERG2WP;
    __IO uint32_t ERG3WP;
    __IO uint32_t ERG4WP;
    __IO uint32_t ERG5WP;
    __IO uint32_t ERG6WP;
    __IO uint32_t ERG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_ergwp_bit_t;

typedef struct
{
    __IO uint32_t ERG0RP;
    __IO uint32_t ERG1RP;
    __IO uint32_t ERG2RP;
    __IO uint32_t ERG3RP;
    __IO uint32_t ERG4RP;
    __IO uint32_t ERG5RP;
    __IO uint32_t ERG6RP;
    __IO uint32_t ERG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_ergrp_bit_t;

typedef struct
{
    __IO uint32_t EMPUBRP;
    __IO uint32_t EMPUBWP;
    __IO uint32_t EMPUACT0;
    __IO uint32_t EMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t EMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_ecr_bit_t;

typedef struct
{
    __IO uint32_t OTSST;
    __IO uint32_t OTSCK;
    __IO uint32_t OTSIE;
    __IO uint32_t TSSTP;
    uint32_t RESERVED0[12];
} stc_ots_ctl_bit_t;

typedef struct
{
    __IO uint32_t USBFS_DFB;
    __IO uint32_t USBFS_SOFEN;
    uint32_t RESERVED0[6];
    __IO uint32_t USBHS_DFB;
    __IO uint32_t USBHS_SOFEN;
    __IO uint32_t USBHS_FSPHYE;
    uint32_t RESERVED1[5];
    __IO uint32_t USBFS_NFS0;
    __IO uint32_t USBFS_NFS1;
    __IO uint32_t USBFS_NFE;
    uint32_t RESERVED2[5];
    __IO uint32_t USBHS_NFS0;
    __IO uint32_t USBHS_NFS1;
    __IO uint32_t USBHS_NFE;
    uint32_t RESERVED3[5];
} stc_peric_usb_syctlreg_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SELMMC1;
    uint32_t RESERVED1[1];
    __IO uint32_t SELMMC2;
    uint32_t RESERVED2[28];
} stc_peric_sdioc_syctlreg_bit_t;

typedef struct
{
    __IO uint32_t OPENP;
    uint32_t RESERVED0[31];
} stc_peric_nfc_stcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t NFCEN;
    uint32_t RESERVED1[29];
} stc_peric_nfc_enar_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SMCEN;
    uint32_t RESERVED1[30];
} stc_peric_smc_enar_bit_t;

typedef struct
{
    __IO uint32_t DMCEN;
    uint32_t RESERVED0[31];
} stc_peric_dmc_enar_bit_t;

typedef struct
{
    __IO uint32_t USASRT1_NFS0;
    __IO uint32_t USASRT1_NFS1;
    __IO uint32_t USART1_NFE;
    uint32_t RESERVED0[29];
} stc_peric_usart1_nfc_bit_t;

typedef struct
{
    __IO uint32_t CHIP_BUSY0;
    __IO uint32_t CHIP_BUSY1;
    __IO uint32_t CHIP_BUSY2;
    __IO uint32_t CHIP_BUSY3;
    __IO uint32_t CHIP_BUSY4;
    __IO uint32_t CHIP_BUSY5;
    __IO uint32_t CHIP_BUSY6;
    __IO uint32_t CHIP_BUSY7;
    __IO uint32_t PECC;
    uint32_t RESERVED0[23];
} stc_peric_nfc_stsr_bit_t;

typedef struct
{
    __IO uint32_t SRAMH;
    uint32_t RESERVED0[3];
    __IO uint32_t SRAM1;
    __IO uint32_t SRAM2;
    __IO uint32_t SRAM3;
    __IO uint32_t SRAM4;
    uint32_t RESERVED1[2];
    __IO uint32_t SRAMB;
    uint32_t RESERVED2[2];
    __IO uint32_t KEY;
    __IO uint32_t DMA1;
    __IO uint32_t DMA2;
    __IO uint32_t FCM;
    __IO uint32_t AOS;
    __IO uint32_t CTC;
    __IO uint32_t CORDIC;
    __IO uint32_t AES;
    __IO uint32_t HASH;
    __IO uint32_t TRNG;
    __IO uint32_t CRC;
    __IO uint32_t DCU1;
    __IO uint32_t DCU2;
    __IO uint32_t DCU3;
    __IO uint32_t DCU4;
    __IO uint32_t DCU5;
    __IO uint32_t DCU6;
    __IO uint32_t DCU7;
    __IO uint32_t DCU8;
} stc_pwc_fcg0_bit_t;

typedef struct
{
    __IO uint32_t CAN1;
    __IO uint32_t CAN2;
    __IO uint32_t ETHER;
    __IO uint32_t QSPI;
    __IO uint32_t I2C1;
    __IO uint32_t I2C2;
    __IO uint32_t I2C3;
    __IO uint32_t I2C4;
    __IO uint32_t I2C5;
    __IO uint32_t I2C6;
    __IO uint32_t SDIOC1;
    __IO uint32_t SDIOC2;
    __IO uint32_t I2S1;
    __IO uint32_t I2S2;
    __IO uint32_t I2S3;
    __IO uint32_t I2S4;
    __IO uint32_t SPI1;
    __IO uint32_t SPI2;
    __IO uint32_t SPI3;
    __IO uint32_t SPI4;
    __IO uint32_t SPI5;
    __IO uint32_t SPI6;
    __IO uint32_t USBFS;
    __IO uint32_t USBHS;
    __IO uint32_t FMAC1;
    __IO uint32_t FMAC2;
    __IO uint32_t FMAC3;
    __IO uint32_t FMAC4;
    uint32_t RESERVED0[4];
} stc_pwc_fcg1_bit_t;

typedef struct
{
    __IO uint32_t TMR6_1;
    __IO uint32_t TMR6_2;
    __IO uint32_t TMR6_3;
    __IO uint32_t TMR6_4;
    __IO uint32_t TMR6_5;
    __IO uint32_t TMR6_6;
    __IO uint32_t TMR6_7;
    __IO uint32_t TMR6_8;
    __IO uint32_t TMR4_1;
    __IO uint32_t TMR4_2;
    __IO uint32_t TMR4_3;
    __IO uint32_t HRPWM;
    __IO uint32_t TMR0_1;
    __IO uint32_t TMR0_2;
    uint32_t RESERVED0[1];
    __IO uint32_t EMB;
    __IO uint32_t TMR2_1;
    __IO uint32_t TMR2_2;
    __IO uint32_t TMR2_3;
    __IO uint32_t TMR2_4;
    __IO uint32_t TMRA_1;
    __IO uint32_t TMRA_2;
    __IO uint32_t TMRA_3;
    __IO uint32_t TMRA_4;
    __IO uint32_t TMRA_5;
    __IO uint32_t TMRA_6;
    __IO uint32_t TMRA_7;
    __IO uint32_t TMRA_8;
    __IO uint32_t TMRA_9;
    __IO uint32_t TMRA_10;
    __IO uint32_t TMRA_11;
    __IO uint32_t TMRA_12;
} stc_pwc_fcg2_bit_t;

typedef struct
{
    __IO uint32_t ADC1;
    __IO uint32_t ADC2;
    __IO uint32_t ADC3;
    __IO uint32_t CMBIAS;
    __IO uint32_t DAC1;
    __IO uint32_t DAC2;
    uint32_t RESERVED0[2];
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    uint32_t RESERVED1[2];
    __IO uint32_t OTS;
    uint32_t RESERVED2[2];
    __IO uint32_t DVP;
    __IO uint32_t SMC;
    __IO uint32_t DMC;
    __IO uint32_t NFC;
    uint32_t RESERVED3[1];
    __IO uint32_t USART1;
    __IO uint32_t USART2;
    __IO uint32_t USART3;
    __IO uint32_t USART4;
    __IO uint32_t USART5;
    __IO uint32_t USART6;
    __IO uint32_t USART7;
    __IO uint32_t USART8;
    __IO uint32_t USART9;
    __IO uint32_t USART10;
    uint32_t RESERVED4[2];
} stc_pwc_fcg3_bit_t;

typedef struct
{
    __IO uint32_t PRT0;
    uint32_t RESERVED0[31];
} stc_pwc_fcg0pc_bit_t;

typedef struct
{
    __IO uint32_t VBTRSD;
    __IO uint32_t RAMVALID;
    __IO uint32_t RAMPDF;
    __IO uint32_t VBATDIVMONE;
    uint32_t RESERVED0[3];
    __IO uint32_t CSDIS;
} stc_pwc_vbatcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_pwc_wktc0_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_pwc_wktc1_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t WKOVF;
    __IO uint32_t WKCKS0;
    __IO uint32_t WKCKS1;
    __IO uint32_t WKTCE;
} stc_pwc_wktc2_bit_t;

typedef struct
{
    __IO uint32_t PDMDS0;
    __IO uint32_t PDMDS1;
    uint32_t RESERVED0[2];
    __IO uint32_t IORTN0;
    __IO uint32_t IORTN1;
    uint32_t RESERVED1[1];
    __IO uint32_t PWDN;
} stc_pwc_pwrc0_bit_t;

typedef struct
{
    __IO uint32_t VPLLSD0;
    __IO uint32_t VPLLSD1;
    __IO uint32_t VHRCSD;
    __IO uint32_t PDTS;
    uint32_t RESERVED0[2];
    __IO uint32_t STPDAS0;
    __IO uint32_t STPDAS1;
} stc_pwc_pwrc1_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t DVS0;
    __IO uint32_t DVS1;
    uint32_t RESERVED1[2];
} stc_pwc_pwrc2_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_pwc_pwrc3_bit_t;

typedef struct
{
    __IO uint32_t VBATREFSEL;
    __IO uint32_t VBATME;
    uint32_t RESERVED0[2];
    __IO uint32_t VBATMON;
    uint32_t RESERVED1[1];
    __IO uint32_t ADBUFS;
    __IO uint32_t ADBUFE;
} stc_pwc_pwrc4_bit_t;

typedef struct
{
    __IO uint32_t EXVCCINEN;
    uint32_t RESERVED0[4];
    __IO uint32_t PVD1EN;
    __IO uint32_t PVD2EN;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr0_bit_t;

typedef struct
{
    __IO uint32_t PVD1IRE;
    __IO uint32_t PVD1IRS;
    __IO uint32_t PVD1CMPOE;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2IRE;
    __IO uint32_t PVD2IRS;
    __IO uint32_t PVD2CMPOE;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr1_bit_t;

typedef struct
{
    __IO uint32_t PVD1NFDIS;
    __IO uint32_t PVD1NFCKS0;
    __IO uint32_t PVD1NFCKS1;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2NFDIS;
    __IO uint32_t PVD2NFCKS0;
    __IO uint32_t PVD2NFCKS1;
    uint32_t RESERVED1[1];
} stc_pwc_pvdfcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_pwc_pvdlcr_bit_t;

typedef struct
{
    __IO uint32_t WKE00;
    __IO uint32_t WKE01;
    __IO uint32_t WKE02;
    __IO uint32_t WKE03;
    __IO uint32_t WKE10;
    __IO uint32_t WKE11;
    __IO uint32_t WKE12;
    __IO uint32_t WKE13;
} stc_pwc_pdwke0_bit_t;

typedef struct
{
    __IO uint32_t WKE20;
    __IO uint32_t WKE21;
    __IO uint32_t WKE22;
    __IO uint32_t WKE23;
    __IO uint32_t WKE30;
    __IO uint32_t WKE31;
    __IO uint32_t WKE32;
    __IO uint32_t WKE33;
} stc_pwc_pdwke1_bit_t;

typedef struct
{
    __IO uint32_t VD1WKE;
    __IO uint32_t VD2WKE;
    uint32_t RESERVED0[2];
    __IO uint32_t RTCPRDWKE;
    __IO uint32_t RTCALMWKE;
    uint32_t RESERVED1[1];
    __IO uint32_t WKTMWKE;
} stc_pwc_pdwke2_bit_t;

typedef struct
{
    __IO uint32_t WK0EGS;
    __IO uint32_t WK1EGS;
    __IO uint32_t WK2EGS;
    __IO uint32_t WK3EGS;
    __IO uint32_t VD1EGS;
    __IO uint32_t VD2EGS;
    uint32_t RESERVED0[2];
} stc_pwc_pdwkes_bit_t;

typedef struct
{
    __IO uint32_t PTWK0F;
    __IO uint32_t PTWK1F;
    __IO uint32_t PTWK2F;
    __IO uint32_t PTWK3F;
    __IO uint32_t VD1WKF;
    __IO uint32_t VD2WKF;
    uint32_t RESERVED0[2];
} stc_pwc_pdwkf0_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t RXD0WKF;
    __IO uint32_t RTCPRDWKF;
    __IO uint32_t RTCALMWKF;
    uint32_t RESERVED1[1];
    __IO uint32_t WKTMWKF;
} stc_pwc_pdwkf1_bit_t;

typedef struct
{
    __IO uint32_t RAMPDC0;
    __IO uint32_t RAMPDC1;
    __IO uint32_t RAMPDC2;
    __IO uint32_t RAMPDC3;
    __IO uint32_t RAMPDC4;
    __IO uint32_t RAMPDC5;
    __IO uint32_t RAMPDC6;
    __IO uint32_t RAMPDC7;
    __IO uint32_t RAMPDC8;
    __IO uint32_t RAMPDC9;
    __IO uint32_t RAMPDC10;
    uint32_t RESERVED0[21];
} stc_pwc_rampc0_bit_t;

typedef struct
{
    __IO uint32_t PRAMPDC0;
    __IO uint32_t PRAMPDC1;
    __IO uint32_t PRAMPDC2;
    __IO uint32_t PRAMPDC3;
    __IO uint32_t PRAMPDC4;
    __IO uint32_t PRAMPDC5;
    __IO uint32_t PRAMPDC6;
    __IO uint32_t PRAMPDC7;
    __IO uint32_t PRAMPDC8;
    __IO uint32_t PRAMPDC9;
    uint32_t RESERVED0[22];
} stc_pwc_pramlpc_bit_t;

typedef struct
{
    __IO uint32_t PVD1NMIS;
    __IO uint32_t PVD1EDGS0;
    __IO uint32_t PVD1EDGS1;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2NMIS;
    __IO uint32_t PVD2EDGS0;
    __IO uint32_t PVD2EDGS1;
    uint32_t RESERVED1[1];
} stc_pwc_pvdicr_bit_t;

typedef struct
{
    __IO uint32_t PVD1MON;
    __IO uint32_t PVD1DETFLG;
    uint32_t RESERVED0[2];
    __IO uint32_t PVD2MON;
    __IO uint32_t PVD2DETFLG;
    uint32_t RESERVED1[2];
} stc_pwc_pvddsr_bit_t;

typedef struct
{
    __IO uint32_t FLNWT;
    __IO uint32_t CKSMRC;
    uint32_t RESERVED0[12];
    __IO uint32_t EXBUSOE;
    __IO uint32_t STOP;
} stc_pwc_stpmcr_bit_t;

typedef struct
{
    __IO uint32_t FPRCB0;
    __IO uint32_t FPRCB1;
    __IO uint32_t FPRCB2;
    __IO uint32_t FPRCB3;
    uint32_t RESERVED0[12];
} stc_pwc_fprc_bit_t;

typedef struct
{
    uint32_t RESERVED0[5];
    __IO uint32_t LKUPREN;
    uint32_t RESERVED1[2];
} stc_rmu_prstcr0_bit_t;

typedef struct
{
    __IO uint32_t PORF;
    __IO uint32_t PINRF;
    __IO uint32_t BORF;
    __IO uint32_t PVD1RF;
    __IO uint32_t PVD2RF;
    __IO uint32_t WDRF;
    __IO uint32_t SWDRF;
    __IO uint32_t PDRF;
    __IO uint32_t SWRF;
    __IO uint32_t MPUERF;
    __IO uint32_t RAPERF;
    __IO uint32_t RAECRF;
    __IO uint32_t CKFERF;
    __IO uint32_t XTALERF;
    __IO uint32_t LKUPRF;
    uint32_t RESERVED0[15];
    __IO uint32_t MULTIRF;
    __IO uint32_t CLRF;
} stc_rmu_rstf0_bit_t;

typedef struct
{
    __IO uint32_t RESET;
    uint32_t RESERVED0[7];
} stc_rtc_cr0_bit_t;

typedef struct
{
    __IO uint32_t PRDS0;
    __IO uint32_t PRDS1;
    __IO uint32_t PRDS2;
    __IO uint32_t AMPM;
    uint32_t RESERVED0[1];
    __IO uint32_t ONEHZOE;
    __IO uint32_t ONEHZSEL;
    __IO uint32_t START;
} stc_rtc_cr1_bit_t;

typedef struct
{
    __IO uint32_t RWREQ;
    __IO uint32_t RWEN;
    __IO uint32_t PRDF;
    __IO uint32_t ALMF;
    uint32_t RESERVED0[1];
    __IO uint32_t PRDIE;
    __IO uint32_t ALMIE;
    __IO uint32_t ALME;
} stc_rtc_cr2_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t LRCEN;
    uint32_t RESERVED1[2];
    __IO uint32_t RCKSEL;
} stc_rtc_cr3_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_sec_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_min_bit_t;

typedef struct
{
    __IO uint32_t HOURU0;
    __IO uint32_t HOURU1;
    __IO uint32_t HOURU2;
    __IO uint32_t HOURU3;
    __IO uint32_t HOURD0;
    __IO uint32_t HOURD1;
    uint32_t RESERVED0[2];
} stc_rtc_hour_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_week_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_day_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_mon_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_year_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_almmin_bit_t;

typedef struct
{
    __IO uint32_t ALMHOURU0;
    __IO uint32_t ALMHOURU1;
    __IO uint32_t ALMHOURU2;
    __IO uint32_t ALMHOURU3;
    __IO uint32_t ALMHOURD0;
    __IO uint32_t ALMHOURD1;
    uint32_t RESERVED0[2];
} stc_rtc_almhour_bit_t;

typedef struct
{
    __IO uint32_t ALMWEEK0;
    __IO uint32_t ALMWEEK1;
    __IO uint32_t ALMWEEK2;
    __IO uint32_t ALMWEEK3;
    __IO uint32_t ALMWEEK4;
    __IO uint32_t ALMWEEK5;
    __IO uint32_t ALMWEEK6;
    uint32_t RESERVED0[1];
} stc_rtc_almweek_bit_t;

typedef struct
{
    __IO uint32_t COMP8;
    uint32_t RESERVED0[6];
    __IO uint32_t COMPEN;
} stc_rtc_errcrh_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_errcrl_bit_t;

typedef struct
{
    __IO uint32_t TPCT00;
    __IO uint32_t TPCT01;
    __IO uint32_t TPNF00;
    __IO uint32_t TPNF01;
    __IO uint32_t TPRSTE0;
    __IO uint32_t TPIE0;
    __IO uint32_t TSTPE0;
    __IO uint32_t TPEN0;
} stc_rtc_tpcr0_bit_t;

typedef struct
{
    __IO uint32_t TPCT10;
    __IO uint32_t TPCT11;
    __IO uint32_t TPNF10;
    __IO uint32_t TPNF11;
    __IO uint32_t TPRSTE1;
    __IO uint32_t TPIE1;
    __IO uint32_t TSTPE1;
    __IO uint32_t TPEN1;
} stc_rtc_tpcr1_bit_t;

typedef struct
{
    __IO uint32_t TPF0;
    __IO uint32_t TPF1;
    __IO uint32_t TPOVF;
    uint32_t RESERVED0[5];
} stc_rtc_tpsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_sectp_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_mintp_bit_t;

typedef struct
{
    __IO uint32_t HOURTPU0;
    __IO uint32_t HOURTPU1;
    __IO uint32_t HOURTPU2;
    __IO uint32_t HOURTPU3;
    __IO uint32_t HOURTPD0;
    __IO uint32_t HOURTPD1;
    uint32_t RESERVED0[2];
} stc_rtc_hourtp_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_daytp_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_montp_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_sdioc_blksize_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t BCE;
    __IO uint32_t ATCEN0;
    __IO uint32_t ATCEN1;
    __IO uint32_t DDIR;
    __IO uint32_t MULB;
    uint32_t RESERVED1[10];
} stc_sdioc_transmode_bit_t;

typedef struct
{
    __IO uint32_t RESTYP0;
    __IO uint32_t RESTYP1;
    uint32_t RESERVED0[1];
    __IO uint32_t CCE;
    __IO uint32_t ICE;
    __IO uint32_t DAT;
    __IO uint32_t TYP0;
    __IO uint32_t TYP1;
    __IO uint32_t IDX0;
    __IO uint32_t IDX1;
    __IO uint32_t IDX2;
    __IO uint32_t IDX3;
    __IO uint32_t IDX4;
    __IO uint32_t IDX5;
    uint32_t RESERVED1[2];
} stc_sdioc_cmd_bit_t;

typedef struct
{
    __IO uint32_t CIC;
    __IO uint32_t CID;
    __IO uint32_t DA;
    uint32_t RESERVED0[5];
    __IO uint32_t WTA;
    __IO uint32_t RTA;
    __IO uint32_t BWE;
    __IO uint32_t BRE;
    uint32_t RESERVED1[4];
    __IO uint32_t CIN;
    __IO uint32_t CSS;
    __IO uint32_t CDL;
    __IO uint32_t WPL;
    __IO uint32_t DATL0;
    __IO uint32_t DATL1;
    __IO uint32_t DATL2;
    __IO uint32_t DATL3;
    __IO uint32_t CMDL;
    uint32_t RESERVED2[7];
} stc_sdioc_pstat_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t DW;
    __IO uint32_t HSEN;
    uint32_t RESERVED1[2];
    __IO uint32_t EXDW;
    __IO uint32_t CDTL;
    __IO uint32_t CDSS;
} stc_sdioc_hostcon_bit_t;

typedef struct
{
    __IO uint32_t PWON;
    uint32_t RESERVED0[7];
} stc_sdioc_pwrcon_bit_t;

typedef struct
{
    __IO uint32_t SABGR;
    __IO uint32_t CR;
    __IO uint32_t RWC;
    __IO uint32_t IABG;
    uint32_t RESERVED0[4];
} stc_sdioc_blkgpcon_bit_t;

typedef struct
{
    __IO uint32_t ICE;
    uint32_t RESERVED0[1];
    __IO uint32_t CE;
    uint32_t RESERVED1[5];
    __IO uint32_t FS0;
    __IO uint32_t FS1;
    __IO uint32_t FS2;
    __IO uint32_t FS3;
    __IO uint32_t FS4;
    __IO uint32_t FS5;
    __IO uint32_t FS6;
    __IO uint32_t FS7;
} stc_sdioc_clkcon_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_sdioc_toutcon_bit_t;

typedef struct
{
    __IO uint32_t RSTA;
    __IO uint32_t RSTC;
    __IO uint32_t RSTD;
    uint32_t RESERVED0[5];
} stc_sdioc_sftrst_bit_t;

typedef struct
{
    __IO uint32_t CC;
    __IO uint32_t TC;
    __IO uint32_t BGE;
    uint32_t RESERVED0[1];
    __IO uint32_t BWR;
    __IO uint32_t BRR;
    __IO uint32_t CIST;
    __IO uint32_t CRM;
    __IO uint32_t CINT;
    uint32_t RESERVED1[6];
    __IO uint32_t EI;
} stc_sdioc_norintst_bit_t;

typedef struct
{
    __IO uint32_t CTOE;
    __IO uint32_t CCE;
    __IO uint32_t CEBE;
    __IO uint32_t CIE;
    __IO uint32_t DTOE;
    __IO uint32_t DCE;
    __IO uint32_t DEBE;
    uint32_t RESERVED0[1];
    __IO uint32_t ACE;
    uint32_t RESERVED1[7];
} stc_sdioc_errintst_bit_t;

typedef struct
{
    __IO uint32_t CCEN;
    __IO uint32_t TCEN;
    __IO uint32_t BGEEN;
    uint32_t RESERVED0[1];
    __IO uint32_t BWREN;
    __IO uint32_t BRREN;
    __IO uint32_t CISTEN;
    __IO uint32_t CRMEN;
    __IO uint32_t CINTEN;
    uint32_t RESERVED1[7];
} stc_sdioc_norintsten_bit_t;

typedef struct
{
    __IO uint32_t CTOEEN;
    __IO uint32_t CCEEN;
    __IO uint32_t CEBEEN;
    __IO uint32_t CIEEN;
    __IO uint32_t DTOEEN;
    __IO uint32_t DCEEN;
    __IO uint32_t DEBEEN;
    uint32_t RESERVED0[1];
    __IO uint32_t ACEEN;
    uint32_t RESERVED1[7];
} stc_sdioc_errintsten_bit_t;

typedef struct
{
    __IO uint32_t CCSEN;
    __IO uint32_t TCSEN;
    __IO uint32_t BGESEN;
    uint32_t RESERVED0[1];
    __IO uint32_t BWRSEN;
    __IO uint32_t BRRSEN;
    __IO uint32_t CISTSEN;
    __IO uint32_t CRMSEN;
    __IO uint32_t CINTSEN;
    uint32_t RESERVED1[7];
} stc_sdioc_norintsgen_bit_t;

